"""Книга коштує a гривень і b копійок.
Визначте, скільки гривень і копійок потрібно заплатити за n книг.
Значення вводяться користувачем у порядку a, b, n на окремих рядках,
а сума до сплати в одному рядку через пропуск: кількість гривень і копійок відповідно.

||| Курс, Бритвич Олександр Володимирович (ПІБ)"""

a = int(input("Введіть кількість гривень: "))
b = int(input("Введіть кількість копійок: "))
n = int(input("Введіть кількість книг: "))

# Перетворення всіх введених гривень і копійок в копійки та множення на кількість книг
coins = (a * 100 + b) * n

# Визначення кількості гривень (ціла частина від ділення на 100)
a_new = coins // 100

# Визначення кількості копійок (остання цифра від ділення на 100)
b_new = coins % 100

print('\nОтже, за всю покупку треба заплатити: ', a_new, 'грн', b_new, 'коп.')
