"""Напишіть програму для сортування трьох цілих чисел
без використання умовних виразів і циклів.

||| курс, Бритвич Олександр Володимирович (ПІБ)"""

print('Введіть три цілих числа через ENTER: ')

# Користувач водить 3 цілих числа
num1 = int(input())
num2 = int(input())
num3 = int(input())

# Створюється список numbers, що містить введені користувачем числа
numbers = [num1, num2, num3]

# Список numbers сортується за зростанням
numbers.sort()

# Змінна sorted_numbers стає посиланням на відсортований список numbers
sorted_numbers = numbers

# Виводиться відсортований список чисел у форматі 'число1, число2, число3'
print('\nВідсортовані числа:', ', '.join(map(str, sorted_numbers)))
